common/models/User.php

SELECT * FROM `user` WHERE (`verification_token`='vgGgMUf2uZe7Hs5FotTEkbZMzyEd2M7I_1574695400') AND (`status`=9)
---
    public static function findByVerificationToken($token) {
        return static::findOne([
            'verification_token' => $token,
            'status' => self::STATUS_INACTIVE
        ]);